Revit 2024 API
BuiltInFailures.StairRampFailures.WinderParallelTreadsNumberFailure Property
 Cannot satisfy the number of Parallel Treads at the Start or End as specified in the Run Instance properties
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WinderParallelTreadsNumberFailure { get; }
Visual Basic
Public Shared ReadOnly Property WinderParallelTreadsNumberFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WinderParallelTreadsNumberFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace